Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: XPATH_USERS (integer)
es: XML_GLOBAL_NAMESPACE

source: It is a good idea to have the DOM standard available when using this module.
es: XML_LOCAL_NAMESPACE

source: Secondly, the function names follow the PHP naming convention.
es: Este modulo define un número de clases.

source: This module defines a number of classes, which are listed — including their method — in the following tables.
es: Las funciones de DOM XML devuelven un árbol conteniendo la structura del documento XML, en el cual cada nodo es un objecto perteneciente a una de estas clases.

source: DomNode_remove_child()
es: DomDocumentType - entities

source: DomComment is derived from DomCData.
es: DomNode - append_child

source: Instead of repeating this string in every example, it will be put into a file which will be included by each example.
es: DomNode - unlink_node

source: Alternatively, you could create an XML document and read it with DomDocument_open_file().
es: DomXsltStylesheet - result_dump_file

source: Those functions provides means to executes commands on the system itself, and means secure such commands.
es: Anterior

source: Also, while in Safe Mode you must consider the safe_mode_exec_dir directive.
es: Siguiente

source: pcntl_wtermsig
es: Subir

source: You should read the documentation at http: / /partners.adobe.com / asn / developer / acrosdk / forms.html for more information on what FDF is and how it is used in general.
es: El Formato de Datos de Formulario (FDF) está diseñado para el manejo de formularios en archivos PDF.

source: The difference is basically the format how data is transmitted to the server when the submit button is pressed (this is actually the Form Data Format) and the format of the form itself (which is the Portable Document Format, PDF).
es: Se aconseja leer la información disponible en http: / /partners.adobe.com / asn / developer / acrosdk / forms.html para más información sobre lo que es FDF y cómo se usa en general.

source: Processing the FDF data is one of the features provided by the fdf functions.
es: Nota:

source: One may as well take an existing PDF form and populated the input fields with data without modifying the form itself.
es: Actualmente Adobe sólo proporciona una versión compatible con libc5 para Linux.

source: In such a case one would create a FDF document (fdf_create()) set the values of each input field (fdf_set_value()) and associate it with a PDF form (fdf_set_file()).
es: Las pruebas con glibc2 provocaron un fallo de segmentado.

source: The Acrobat reader plugin of your browser recognizes the MimeType, reads the associated PDF form and fills in the data from the FDF document.
es: Nota:

source: Such an object may contain a number of entries like Fields, F, Status etc..
es: Si tiene problemas configurando php con soporte de fdftk, compruebe si el archivo de cabecera FdfTk.h y la librería libFdfTk.so están en su lugar correcto.

source: The most commonly used entries are Fields which points to a list of input fields, and F which contains the filename of the PDF-document this data belongs to.
es: Deberían encontrarse respectivamente en fdftk-dir / include y en fdftk-dir / lib.

source: Those entries are referred to in the FDF documentation as / F-Key or / Status-Key.
es: Este problema no se dará si se limita a desempaqueta la distribucón del FtdTk.

source: Modifying this entries is done by functions like fdf_set_file() and fdf_set_status().
es: La idea general del FDF es similar a los formularios HTML.

source: You need the FDF toolkit SDK available from http: / /partners.adobe.com / asn / developer / acrosdk / forms.html.
es: La diferencia básicamente está en el formato en que se transmiten los datos al servidor cuando se pulsa el botón de envío (este es realmente el Formato de Datos de Formulario) y el formato del formulario en sí mismo (que es el Formato de Documento Portable, PDF).

source: The FDF toolkit library is available in binary form only, platforms supported by Adobe are Win32, Linux, Solaris and AIX.
es: Procesar lo datos del FDF es una de las características que proporcionan las funciones fdf.

source: The configure script supports both the directory structure of the FDF SDK distribution and the usual DIR / include / DIR / lib layout, so you can point it either directly to the unpacked distribution directory or put the header file and the appropriate library for your platform into e.g. / usr / local / include and / usr / local / lib and configure with --with-fdftk= / usr / local.
es: Uno también puede tomar un formulario PDF y rellenar los campos de entrada con datos sin modificar el formulario en sí mismo.

source: In order to enable this module on a Windows environment, you must copy fdftk.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: En dicho caso, lo que se hace es crear un documento FDF (fdf_create()), fijar los valores de cada campo de entrada (fdf_set_value()) y asociarlo con un formulario PDF (fdf_set_file()).

source: A fdf resource is a handle to an opened fdf file. fdf resources may be obtained using fdf_create(), fdf_open() and fdf_open_string().
es: El plug-in de Acrobar reader de su navegador reconoce el MimeType, lee el formulario PDF asociado y rellena los datos a partir del documento FDF.

source: The following examples shows just the evaluation of form data.
es: Ejemplo 1.

source: ?php / / Open fdf from input string provided by the extension / / The pdf form contained several input text fields with the names / / volume, date, comment, publisher, preparer, and two checkboxes / / show_publisher and show_preparer. $fdf = fdf_open_string( $HTTP_FDF_DATA); $volume = fdf_get_value($fdf, "volume"); echo "The volume field has the value 'B $volume / B' BR "; $date = fdf_get_value($fdf, "date"); echo "The date field has the value 'B $date / B' BR"; $comment = fdf_get_value($fdf, "comment"); echo "The comment field has the value 'B $comment / B' BR "; if(fdf_get_value($fdf, "show_publisher") == "On") {$publisher = fdf_get_value($fdf, "publisher"); echo "The publisher field has the value 'B $publisher / B' BR";} else echo "Publisher shall not be shown.
es: ?php / / Guarda los datos FDF en un archivo temporal $fdffp = fopen( "test.fdf", "w"); fwrite($fdffp, $HTTP_FDF_DATA, strlen($HTTP_FDF_DATA)); fclose($fdffp); / / Abre archivo temporal y evalúa los datos / / El formulario pdf contenía varios campos de texto con los nombres / / volumen, fecha, comentario, editorial, preparador, y dos casillas de verificación / / muestra_editorial y muestra_preparador. $fdf = fdf_open("test.fdf"); $volume = fdf_get_value($fdf, "volumen"); echo "El campo volumen tiene el valor 'B $volume / B' BR "; $date = fdf_get_value($fdf, "fecha"); echo "El campo fecha tiene el valor 'B $date / B' BR"; $comment = fdf_get_value($fdf, "comentario"); echo "El campo comentario tiene el valor 'B $comment / B' BR "; if(fdf_get_value($fdf, "muestra_editorial") == "On") {$publisher = fdf_get_value($fdf, "editorial"); echo "El campo editorial tiene el valor 'B $publisher / B' BR";} else echo "No se debe mostrar la editorial.

source: BR "; if(fdf_get_value($fdf, "show_preparer") == "On") {$preparer = fdf_get_value($fdf, "preparer"); echo "The preparer field has the value 'B $preparer / B' BR";} else echo "Preparer shall not be shown.
es: BR "; if(fdf_get_value($fdf, "muestra_preparador") == "On") {$preparer = fdf_get_value($fdf, "preparador"); echo "El campo preparador tiene el valor 'B $preparer / B' BR";} else echo "No se debe mostrar el preparador.

source: filePro is a registered trademark of fP Technologies, Inc.
es: Estas funciones permiten acceso en modo de solo-lectura a datos guardados en bases de datos filePro.

source: filePro support in PHP is not enabled by default.
es: filePro es una marca registrada de fP Technologies, Inc.

source: To enable the bundled read-only filePro support you need to use the --enable-filepro configuration option when compiling PHP.
es: Mas informacion sobre filePro puede encontrarse en http: / /www.fptech.com /.

source: The behaviour of these functions is affected by settings in php.ini.
es: Manual de PHP

source: This option enables the URL-aware fopen wrappers that enable accessing URL object like files.
es: Anterior

source: For versions up to and including 4.0.3 you can only disable this feature at compile time by using the configuration switch --disable-url-fopen-wrapper.
es: Anterior

source: Define the user agent for PHP to send.
es: Inicio

source: Define the anonymous ftp password (your email address).
es: Siguiente

source: Automatically determine resume position and start position for GET and PUT requests (only works if FTP_AUTOSEEK is enabled)
es: FTP_ASCII, y FTP_BINARY.

source: Please see the gettext documentation for your system for a thorough explanation of these functions or view the docs at http: / /www.gnu.org / manual / gettext / index.html.
es: Anterior

source: To include GNU gettext support in your PHP build you must add the option --with-gettext[ =DIR] where DIR is the gettext install directory, defaults to / usr / local.
es: Siguiente

source: In order to enable this module on a Windows environment, you must copy gnu_gettext.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: Anterior

source: Starting with PHP 4.2.3 the name changed to libintl-1.dll
es: Inicio

source: unregister_tick_function
es: Subir

source: These functions have been added in PHP 4.0.4.
es: These functions allow you to work with arbitrary-length integers using GNU MP library.

source: This extension is not available on Windows platforms.
es: Nota:

source: Some functions may require more recent version of the GMP library.
es: However, most of these functions will accept also numeric and string arguments, given it 's possible to convert the latter to number.

source: More mathmatical functions can be found in the sections BCMath Arbitrary Precision Mathematics Functions and Mathematical Functions.
es: This will calculate factiorial of 1000 (pretty big number) very fast.

source: Hyperwave has been developed at IICM in Graz.
es: Hyperwave ha sido desarrollado en el IICM en Graz.

source: It started with the name Hyper-G and changed to Hyperwave when it was commercialised (in 1996).
es: Comenzó con el nombre Hyper-G y cambió a Hyperwave cuando fue comercializado (Si lo recuerdo bien, fue en 1996).

source: Hyperwave is not free software.
es: Hyperwave no es software gratuiro.

source: The current version, 5.5 is available at http: / /www.hyperwave.com /.
es: La versión actual, 4.1, está disponible en www.hyperwave.com.

source: A time limited version can be ordered for free (30 days).
es: Se puede solicitar gratuitamente una versión limitada (30 días).

source: Hyperwave is an information system similar to a database (HIS, Hyperwave Information Server).
es: Hyperwave es un sistema de información similar a una base de datos (HIS, Hyperwave Information Server - Servidor Hyperwave de Información).

source: Its focus is the storage and management of documents.
es: Su objetivo es el almacenamiento y manipulación de documentos.

source: A document can be any possible piece of data that may as well be stored in file.
es: Un documento puede ser cualquier bloque posible de datos que también puede ser almacenado en un archivo.

source: Each document is accompanied by its object record.
es: Cada documento se acompaña por su registro de objeto.

source: The object record contains meta data for the document.
es: El registro de objeto contiene metadatos para el documento.

source: The meta data is a list of attributes which can be extended by the user.
es: Los metadatos son una lista de atributos que pueden ser extendidos por el usuario.

source: Certain attributes are always set by the Hyperwave server, other may be modified by the user.
es: Ciertos atributos siempre son fijados por el servidor Hyperwave, otros pueden ser modificados por el usuario.

source: An attribute is a name / value pair of the form name=value.
es: Un atributo es un par nombre / valor de la forma nombre=valor.

source: The complete object record contains as many of those pairs as the user likes.
es: El registro completo del objeto tiene tantos de estos pares como guste el usuario.

source: The name of an attribute does not have to be unique, e.g. a title may appear several times within an object record.
es: El nombre de un atributo no tiene porqué ser único, p. ej. un título puede aparecer varias veces en el registro de un objeto.

source: This makes sense if you want to specify a title in several languages.
es: Esto tiene sentido si se desea especificar un título en diferentes idiomas.

source: In such a case there is a convention, that each title value is preceded by the two letter language abbreviation followed by a colon, e.g. 'en:Title in English' or'ge:Titel in deutsch '.
es: En dicho caso existe la convención de que cada valor de título esté precedido por la abreviatura de dos letras del idioma, seguida por dos puntos, como p. ej. 'en:Title in English' o 'es:Título en Español '.

source: Other attributes like a description or keywords are potential candidates.
es: Otros atributos tales como descripciones o palabras clave son canditatos potenciales a esta diferenciación.

source: You may also replace the language abbreviation by any other string as long as it separated by colon from the rest of the attribute value.
es: También se pueden reemplazar las abreviaturas de idioma por cualquier otra cadena siempre y cuando estén separadas por los dos puntos del resto del valor del atributo.

source: Each object record has native a string representation with each name / value pair separated by a newline.
es: Cada registro de objeto tiene una representación nativa como cadena con cada par nombre / valor separado por una línea nueva.

source: The Hyperwave extension also knows a second representation which is an associated array with the attribute name being the key.
es: La extensión Hyperwave también conoce una segunda representación que consiste en un array asociativo donde el nombre del atributo es la clave.

source: Multilingual attribute values itself form another associated array with the key being the language abbreviation.
es: Los valores de atributo multilingües en sí mismos forman otro array asociativo donde la clave es la abreviatura del idioma.

source: Actually any multiple attribute forms an associated array with the string left to the colon in the attribute value being the key. (This is not fully implemented.
es: Realmente cualquier atributo múltiple forma una tabla asociativa donde la cadena a la izquierda de los dos puntos en el valor de atributo es la clave. (Esto no se ha implementado por completo.

source: Only the attributes Title, Description and Keyword are treated properly yet.)
es: Sólo los atributos Title, Description y Keyword son tratados adecuadamente.)

source: Besides the documents, all hyper links contained in a document are stored as object records as well.
es: Aparte de los documentos, todos los hiper-enlaces contenidos en un documento son almacenados también como registros de objeto.

source: Hyper links which are in a document will be removed from it and stored as individual objects, when the document is inserted into the database.
es: Cuando el documento sea insertado en la base de datos, los hiper-enlaces que haya en un documento serán borrados del mismo y almacenados como objetos individuales.

source: The object record of the link contains information about where it starts and where it ends.
es: El registro de objeto del enlace contiene información acerca de dónde comienza y dónde termina.

source: The functions hw_pipedocument() and hw_gettext() do this for you.
es: Para recuperar el documento original se deberá recuperar el documento sin los enlaces y la lista de los mismos para reinsertarla (Las funciones hw_pipedocument() y hw_gettext() hacen esto para usted).

source: The advantage of separating links from the document is obvious.
es: La ventaja de separar los enlaces del documento es obvia.

source: Once a document to which a link is pointing to changes its name, the link can easily be modified accordingly.
es: Una vez un documento al que apunta un enlace cambia de nombre, el enlace puede modificarse fácilmente.

source: The document containing the link is not affected at all.
es: El documento que contiene el enlace no se ve afectado.

source: You may even add a link to a document without modifying the document itself.
es: Incluso se puede añadir un enlace a un documento sin alterarlo.

source: Saying that hw_pipedocument() and hw_gettext() do the link insertion automatically is not as simple as it sounds.
es: Decir que hw_pipedocument() y hw_gettext() hacen automáticamente la inserción de enlaces no es tan simple como suena.

source: Inserting links implies a certain hierarchy of the documents.
es: Insertar los enlaces implica una cierta jerarquía en los documentos.

source: On a web server this is given by the file system, but Hyperwave has its own hierarchy and names do not reflect the position of an object in that hierarchy.
es: En un servidor web esto viene dado por el sistema de archivos, pero el Hyperwave tiene su propia jerarquía y los nombres no representan la posición de un objeto en dicha jerarquía.

source: Therefore creation of links first of all requires a mapping from the Hyperwave hierarchy and namespace into a web hierarchy respective web namespace.
es: Por tanto, la creación de los enlaces precisa primeramente de realizar un mapeado entre el espacio de nombres y la jerarquía del Hyperwave y el espacio de nombres respectivo de una jerarquía de web.

source: The fundamental difference between Hyperwave and the web is the clear distinction between names and hierarchy in Hyperwave.
es: La diferencia fundamental entre Hyperwave y la web es la distinción clara entre nombres y jerarquía que se da en el primero.

source: The name does not contain any information about the objects position in the hierarchy.
es: El nombre no contiene ninguna información sobre la posición del objeto en la jerarquía.

source: In the web the name also contains the information on where the object is located in the hierarchy.
es: En la web, el nombre también contiene la información sobre la posición en la jerarquía del objeto.

source: This leads to two possibles ways of mapping.
es: Esto nos lleva a dos posibles formas de mapeo.

source: Either the Hyperwave hierarchy and name of the Hyperwave object is reflected in the URL or the name only.
es: O bien se reflejan la jerarquía del Hyperwave y el nombre del objeto Hyperwave en el URL o sólo el nombre.

source: To make things simple the second approach is used.
es: Para facilitar las cosas, se utiliza el segundo método.

source: Hyperwave object with name my_object is mapped to http: / /host / my_object disregarding where it resides in the Hyperwave hierarchy.
es: El objeto Hyperwave de nombre 'mi_objeto' es mapeado a 'http: / /host / mi_objeto 'sin importar dónde reside dentro de la jerarquía de Hyperwave.

source: This can only be prevented by selecting reasonable object names.
es: Un objeto con el nombre 'padre / mi_objeto' podría ser el hijo de 'mi_objeto 'en la jerarquía Hyperwave, aunque en el espacio de nombres web aparezca justamente lo opuesto y el usuario pueda ser llevado a confusión.

source: How do you involve PHP?
es: Esto sólo se puede evitar seleccionando nombres de objetos razonables.

source: The URL http: / /host / my_object will not call any PHP script unless you tell your web server to rewrite it to e.g. http: / /host / php_script / my_object and the script php_script evaluates the $PATH_INFO variable and retrieves the object with name my_object The URL http: / /host / my_object will not call any PHP script unless you tell your web server to rewrite it to e.g. http: / /host / php_script / my_object and the script php_script evaluates the $PATH_INFO variable and retrieves the object with name my_object from the Hyperwave server.
es: Hay sólo un pequeño inconveniente que se puede resolver fácilmente.

source: Their is just one little drawback which can be fixed easily.
es: Cuando se reescribe cualquier URL no se permite el acceso a ningún otro documento en el servidor web.

source: Rewriting any URL would not allow any access to other document on the web server.
es: Un script de PHP para buscar en el servidor Hyperwave sería imposible.

source: Therefore you will need at least a second rewriting rule to exclude certain URLs like all e.g. starting with http: / /host / Hyperwave This is basically sharing of a namespace by the web and Hyperwave server.
es: Básicamente esto sería compartir un espacio de nombres entre el servidor web y el servidor Hyperwave.

source: Based on the above mechanism links are insert into documents.
es: Los enlaces se insertan en los documentos basándose en el mecanismo citado más arriba.

source: It gets more complicated if PHP is not run as a server module or CGI script but as a standalone application e.g. to dump the content of the Hyperwave server on a CD-ROM.
es: Se vuelve más complicado si el PHP no se está ejecutando como módulo del servidor o como script CGI, sino que se ejecuta como aplicación, p. ej. para volcar el contenido del servidor de Hyperwave a un CD-ROM.

source: In such a case it makes sense to retain the Hyperwave hierarchy and map in onto the file system.
es: En dicho caso tiene sentido mantener la jerarquía Hyperwave y mapearla en el sistema de archivos.

source: This conflicts with the object names if they reflect its own hierarchy (e.g. by choosing names including '/').
es: Esto entra conflicto con los nombres de los objetos si estos reflejan su propia jerarquía (p. ej. eligiendo nombres que comienzan por '/').

source: Therefore '/' has to be replaced by another character, e.g. '_ '.
es: Por tanto, la '/' tendrá que ser reemplazada por otro carácter, p. ej. '_ 'para continuar.

source: The network protocol to communicate with the Hyperwave server is called HG-CSP (Hyper-G Client / Server Protocol).
es: El protocolo de red para comunicarse con el servidor Hyperwave se denomina HG-CSP (Hyper-G Client / Server Protocol, Protocolo Hyper-G Cliente / Servidor).

source: It is based on messages to initiate certain actions, e.g. get object record.
es: Está basado en mensajes que inician ciertas acciones, p. ej. obtener el registro de un objeto.

source: In early versions of the Hyperwave Server two native clients (Harmony, Amadeus) were provided for communication with the server.
es: En versiones anteriores del Servidor Hyperwave se distribuyeron dos clientes nativos (Harmony, Amadeus) para la comunicación con el servidor.

source: Those two disappeared when Hyperwave was commercialised.
es: Ambos desaparecieron cuando se comercializó el Hyperwave.

source: As a replacement a so called wavemaster was provided.
es: Para sustituírlo se proporcionó el llamado wavemaster.

source: The wavemaster is like a protocol converter from HTTP to HG-CSP.
es: El wavemaster es como un conversor de protocolo de HTTP a HG-CSP.

source: The idea is to do all the administration of the database and visualisation of documents by a web interface.
es: La idea es realizar toda la administración de la base de datos y la visualización de documentos con una interfaz web.

source: The wavemaster implements a set of placeholders for certain actions to customise the interface.
es: El wavemaster implementa una serie de posicionadores para acciones que permiten personalizar la interfaz.

source: This set of placeholders is called the PLACE Language.
es: Dicho conjunto de posicionadores se denomina el Lenguaje PLACE.
